Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsets Property
 The column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSlantedColumnOffsets { get; }
Public Shared ReadOnly Property InvalidSlantedColumnOffsets As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSlantedColumnOffsets {
	FailureDefinitionId^ get ();
}
static member InvalidSlantedColumnOffsets : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace